In [2]:
import pandas as pd
import numpy as np

In [6]:
my_df = pd.DataFrame({'Column1': ['a', 'b', 'c', 'd', 'e'],
                      'Column2': [3, 5, 9, 43, 8],
                     'Column3': [63, 2, 0, 15, 4]}, columns=['Column1', 'Column2', 'Column3'])
my_df

  Column1  Column2  Column3
0       a        3       63
1       b        5        2
2       c        9        0
3       d       43       15
4       e        8        4

In [7]:
my_df.shape

(5, 3)

In [9]:
my_df.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
my_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  5 non-null      object
 1   Column2  5 non-null      int64
 2   Column3  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [11]:
my_df.describe()

         Column2    Column3
count   5.000000   5.000000
mean   13.600000  16.800000
std    16.607227  26.470739
min     3.000000   0.000000
25%     5.000000   2.000000
50%     8.000000   4.000000
75%     9.000000  15.000000
max    43.000000  63.000000

In [14]:
my_df.head(2)

  Column1  Column2  Column3
0       a        3       63
1       b        5        2

In [16]:
my_df.Column2.head(3)

0    3
1    5
2    9
Name: Column2, dtype: int64

In [19]:
my_df['Column1'].head()

0    a
1    b
2    c
3    d
4    e
Name: Column1, dtype: object

In [22]:
my_df.tail(2)

  Column1  Column2  Column3
3       d       43       15
4       e        8        4

In [24]:
my_df.index = [2, 4, 6, 8, 15]
my_df

   Column1  Column2  Column3
2        a        3       63
4        b        5        2
6        c        9        0
8        d       43       15
15       e        8        4

In [25]:
my_df.loc[2, 'Column1']

'a'

In [26]:
my_df.loc[15, :]

Column1    e
Column2    8
Column3    4
Name: 15, dtype: object

In [27]:
my_df.loc[[15, 8], :]

   Column1  Column2  Column3
15       e        8        4
8        d       43       15

In [28]:
my_df.loc[my_df['Column2'] == 43, 'Column1']

8    d
Name: Column1, dtype: object

In [29]:
my_df.loc[my_df['Column3'].between(0, 4), :]

   Column1  Column2  Column3
4        b        5        2
6        c        9        0
15       e        8        4

In [32]:
my_df.loc[(my_df['Column1'] == 'c') | (~my_df['Column2'].isin([43, 8]))]

  Column1  Column2  Column3
2       a        3       63
4       b        5        2
6       c        9        0

In [35]:
my_df.query('Column2 > 8')

  Column1  Column2  Column3
6       c        9        0
8       d       43       15

In [40]:
s = my_df['Column1']
type(s)

2     a
4     b
6     c
8     d
15    e
Name: Column1, dtype: object

In [39]:
new_df = pd.DataFrame(s)
new_df

   Column1
2        a
4        b
6        c
8        d
15       e

In [41]:
my_df.sample(n = 3)

  Column1  Column2  Column3
2       a        3       63
4       b        5        2
8       d       43       15